Updated README.md and mqtt_topics.md
